---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DiameterSymbolText
source: html/81353d7f-0b23-1362-7074-980aee3c9e24.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DiameterSymbolText Property

"Diameter Symbol Text"

## Syntax (C#)
```csharp
public static ForgeTypeId DiameterSymbolText { get; }
```